app/Helpers/notificaciones_helper.php

function tieneNotificaciones($usuarioId)
{
    if (!$usuarioId) return false;

    $tareaModel = new Tarea();
    $hoy = date('Y-m-d');

    return $tareaModel
        ->where('u_id', $usuarioId)
        ->where('t_estado !=', 3) // No completadas
        ->where('t_fechaRec IS NOT NULL')
        ->where('t_fechaRec <=', $hoy)
        ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `tarea`
WHERE `u_id` = '3'
AND `t_estado` != 3
AND `t_fechaRec` IS NOT NULL
AND `t_fechaRec` <= '2025-05-16'