app/Controllers/Colaboraciones.php

SELECT *
FROM `usuario`
WHERE `u_email` = 'juanaLopez@gmail.com'
 LIMIT 1
---
public function agregar_colaborador()
{
    helper(['form', 'url']);

     $tareaColaboradorModel = new TareaColaborador();

        $rules = [
            'correo' => 'required|valid_email',
            'tipo_colaboracion' => 'required|in_list[lectura,edicion]'
        ];

        if (!$this->validate($rules)) {
            // Retornar con errores de validación
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }
        $id= $this->request->getPost('t_id');
        $correo = $this->request->getPost('correo');
        $permiso = $this->request->getPost('tipo_colaboracion');

        // Buscar usuario por correo
        $usuarioModel = new \App\Models\Usuario();
        $usuario = $usuarioModel->where('u_email', $correo)->first();