app/Controllers/Subtareas.php

INSERT INTO `subtarea` (`t_id`, `u_id`, `st_asunto`, `st_descripcion`, `st_estado`, `st_prioridad`, `st_fechaVenc`, `st_comentario`) VALUES ('13', '3', 'Muestra 222', '222222', 1, 'Alta', '2025-05-22', '')
---
            'st_comentario'  => $this->request->getPost('st_comentario')
        ];

        $subtareaModel->insert($data);