app/Controllers/Tareas.php

    public function index()
{
    $tareaModel = new \App\Models\Tarea();
    $usuarioId = session()->get('u_id');

    $orden = $this->request->getGet('orden');

    // Aplicar ordenamiento
    switch ($orden) {
        case 'vencimiento_asc':
            $tareaModel->orderBy('t_fechaVenc', 'ASC');
            break;
        case 'vencimiento_desc':
            $tareaModel->orderBy('t_fechaVenc', 'DESC');
            break;
        case 'asunto_asc':
            $tareaModel->orderBy('t_asunto', 'ASC');
            break;
        case 'asunto_desc':
            $tareaModel->orderBy('t_asunto', 'DESC');
            break;
        case 'prioridad':
            $tareaModel->orderBy('t_prioridad', 'DESC');
            break;
        default:
            $tareaModel->orderBy('t_id', 'DESC');
            break;
    }

    // Obtener tareas del usuario (propias o en las que colabora), sin las archivadas
    $tareas = $tareaModel
        ->select('tarea.*') // Solo columnas de la tabla tarea
        ->join('tarea_colaboradores', 'tarea.t_id = tarea_colaboradores.t_id', 'left')
        ->groupStart()
            ->where('tarea.u_id', $usuarioId)
            ->orWhere('tarea_colaboradores.u_id', $usuarioId)
        ->groupEnd()
        ->where('tarea.t_estado !=', 4)
        ->findAll();
---
SELECT `tarea`.*
FROM `tarea`
LEFT JOIN `tarea_colaboradores` ON `tarea`.`t_id` = `tarea_colaboradores`.`t_id`
WHERE   (
`tarea`.`u_id` = '3'
OR `tarea_colaboradores`.`u_id` = '3'
 )
AND `tarea`.`t_estado` != 4
ORDER BY `t_id` DESC

public function ver_tarea($id = null)
{
    $tareaModel = new Tarea();
    $subtareaModel = new Subtarea();
    $usuarioModel= new Usuario();

//para pasar colab de esta tarea especidifca
    $colaboradoresModel = new \App\Models\TareaColaborador();
    $colaboradores = $colaboradoresModel->obtenerColaboradoresPorTarea($id);
    $data['colaboradores'] = $colaboradores;



//para mostrar las subtareas
    $tarea = $tareaModel->find($id);
    $subtareas = $subtareaModel->where('t_id', $id)->findAll();

    foreach ($subtareas as &$sub) {
    if (!empty($sub['st_responsable'])) {
        $responsable = $usuarioModel->find($sub['st_responsable']);
---
SELECT *
FROM `tarea`
WHERE `tarea`.`t_id` = '13'
SELECT *
FROM `subtarea`
WHERE `t_id` = '13'
SELECT *
FROM `usuario`
WHERE `usuario`.`u_id` = '4'

public function completar_tarea($tareaId)
{
    $tareaModel = new \App\Models\Tarea();
    $subtareaModel = new \App\Models\Subtarea();

    $tarea = $tareaModel->find($tareaId);

    if (!$tarea) {
        return redirect()->to(base_url('mostrar_tareas'))->with('error', 'Tarea no encontrada.');
    }

    // Verificar si la tarea tiene subtareas
    $subtareas = $subtareaModel->where('t_id', $tareaId)->findAll();
---
SELECT *
FROM `tarea`
WHERE `tarea`.`t_id` = '13'
SELECT *
FROM `subtarea`
WHERE `t_id` = '13'