app/Models/Tarea.php

SELECT *
FROM `tarea`
WHERE `t_id` = '13'
 LIMIT 1
---
 public function obtenerTareaPorId($id)
    {
        return $this->where('t_id', $id)->first();