app/Models/TareaColaborador.php

    public function obtenerColaboradoresPorTarea($tareaId)
    {
        return $this->select('usuario.u_id, usuario.u_user, usuario.u_email')
                    ->join('usuario', 'usuario.u_id = tarea_colaboradores.u_id')
                    ->where('tarea_colaboradores.t_id', $tareaId)
                    ->findAll();
---
SELECT `usuario`.`u_id`, `usuario`.`u_user`, `usuario`.`u_email`
FROM `tarea_colaboradores`
JOIN `usuario` ON `usuario`.`u_id` = `tarea_colaboradores`.`u_id`
WHERE `tarea_colaboradores`.`t_id` = '13'